In [186]:
# !pip install pypdf3
# !pip install tabula-py
# !pip install camelot-py

import pandas as pd
import numpy as np
# import camelot as camel
from PyPDF3 import PdfFileReader 
from tabula import read_pdf 
from tabulate import tabulate

from my_modules import my_functions as mybib
from my_modules import project_functions as pr


%load_ext autoreload
%autoreload 2


# https://www.youtube.com/watch?v=702lkQbZx50 - for tabula
# https://stackoverflow.com/questions/45457054/tabula-extract-tables-by-area-coordinates - for tabula

The autoreload extension is already loaded. To reload it, use:
  %reload_ext autoreload

In [187]:
import os 
import re

list_of_files = os.listdir('../data/input/berlin_adresses/2023')
list_of_files

['adr_charlottenburg-wilmdersdorf_2023.pdf',
 'adr_friedrichshain-kreuzberg_2023.pdf',
 'adr_lichtenberg_2023.pdf',
 'adr_marzahn-hellersdorf_2023.pdf',
 'adr_mitte_2023.pdf',
 'adr_neukoelln_2023.pdf',
 'adr_pankow_2023.pdf',
 'adr_reinickendorf_2023.pdf',
 'adr_spandau_2023.pdf',
 'adr_steglitz-zehlendorf_2023.pdf',
 'adr_tempelhof-schoeneberg_2023.pdf',
 'adr_treptow-koepenick_2023.pdf']

In [188]:
    # import_data = read_pdf('../data/input/berlin_adresses/2023/adr_charlottenburg-wilmdersdorf_2023.pdf', pages = 30, encoding = 'ISO-8859-1', stream = True, area = [164, 33, 783, 520], guess = True, pandas_options={'header': None})
    # table_df = import_data[0]
    # # table_df. pop_data.insert(0, 'year', year)
    # table_df

In [189]:
    # import_data = read_pdf('../data/input/berlin_adresses/2023/adr_charlottenburg-wilmdersdorf_2023.pdf', pages = 54, encoding = 'ISO-8859-1', stream = True, area = [164, 33, 783, 520], guess = True, pandas_options={'header': None})
    # table_df = import_data[0]
    # columns_len = len(table_df.columns)
    # print(columns_len)
    
    # display(table_df.head(2))
    
    # if columns_len < 14:
    #     if table_df.iloc[:, 3].dtype in ['int64', 'int32', 'float64', 'float32']:
    #         table_df.insert(3, 'm1', np.nan)

    #     if table_df.iloc[:, 6].dtype in ['int64', 'int32', 'float64', 'float32']:
    #         table_df.insert(5, 'm2', np.nan)
        
        
    #     column_length = len(table_df.columns)

        
    #     if column_length < 14:
    #        table_df['m3'] = np.nan
            
        
        
    # table_df

In [198]:
def extract_all_pages_from_pdf(path, file_name):
    # open path as binary / rb = read binary -> used for pdf files (https://www.youtube.com/watch?v=OZo2HxoIOtw)
            
    pdf = PdfFileReader(open(path, 'rb'))
    last_page = pdf.getNumPages()
    last_page += 1

    # defining page range for import 
    [i for i in range(0, 15)]
    page_range = [i for i in range(5, last_page)]
    print(page_range)

    # prepare column name filler
    column_names = [i for i in range(0, 14)]
    print(colum_names)

    # create empty dataframe
    adress_data = pd.DataFrame(columns = column_names)
    display(adress_data)
    
    # extract district information
    district = [re.findall(r'(?<=adr_)(.*?)(?=_2023\.pdf)', file_name)]
    print(district)

    for page in page_range:
        
        import_data = read_pdf(path, pages = page, encoding = 'ISO-8859-1', stream = True, area = [175, 33, 783, 520], guess = False, pandas_options={'header': None})
        table_df = import_data[0]

        
        table_df = import_data[0]
        columns_len = len(table_df.columns)

        if columns_len < 14:
            if table_df.iloc[:, 3].dtype in ['int64', 'int32', 'float64', 'float32']:
                table_df.insert(3, 'm1', np.nan)

            if table_df.iloc[:, 6].dtype in ['int64', 'int32', 'float64', 'float32']:
                table_df.insert(5, 'm2', np.nan)
            
            
            column_length = len(table_df.columns)

            
            if column_length < 14:
                table_df['m3'] = np.nan
            
            
            table_df.columns = column_names
            table_df['14'] = str(district[0][0])
            
            adress_data = pd.concat([adress_data, table_df], ignore_index=True , axis=0)
            
            print(f'page: {page}')
            print(adress_data.shape)
    
    return adress_data, district[0][0]

In [199]:


for file_name in list_of_files:
    path = f'../data/input/berlin_adresses/2023/{file_name}'
    print(path)
    
    dataset, name = extract_all_pages_from_pdf(path, file_name)
    
    dataset.to_csv(f'../data/output/temp_adress_data{name}-2023.csv', index = False)
    display(dataset.head(5))
    print(dataset.shape)
    
# # open path as binary / rb = read binary -> used for pdf files (https://www.youtube.com/watch?v=OZo2HxoIOtw)
        
# pdf = PdfFileReader(open(path, 'rb'))
# last_page = pdf.getNumPages()
# last_page += 1

../data/input/berlin_adresses/2023/adr_charlottenburg-wilmdersdorf_2023.pdf
[5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
Index: []

[['charlottenburg-wilmdersdorf']]
page: 5
(48, 15)
page: 6
(96, 15)
page: 7
(144, 15)
page: 8
(192, 15)
page: 9
(240, 15)
page: 10
(288, 15)
page: 11
(336, 15)
page: 13
(384, 15)
page: 14
(432, 15)
page: 15
(480, 15)
page: 16
(528, 15)
page: 17
(576, 15)
page: 19
(624, 15)
page: 20
(672, 15)
page: 22
(720, 15)
page: 23
(768, 15)
page: 24
(816, 15)
page: 25
(864, 15)
page: 26
(912, 15)
page: 27
(960, 15)
page: 28
(1008, 15)
page: 29
(1056, 15)
page: 32
(1104, 15)
page: 33
(1152, 15)
page: 34
(1200, 15)
page: 37
(1248, 15)
page: 38
(1296, 15)
page: 42
(1344, 15)
page: 43
(1392, 15)
page: 44
(1440, 15)
page: 45
(1488, 15)
page: 49
(1536, 15)
page: 50
(1584, 15)
page: 51
(1632, 15)
page: 52
(1680, 15)
page: 54
(1701, 15)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,1,Aachener Straße,1,NaN,45,NaN,U,4,50,11,48,Wilmd,10713,NaN,charlottenburg-wilmdersdorf
1,1,Aachener Straße,2,NaN,44,NaN,G,4,50,11,48,Wilmd,10713,NaN,charlottenburg-wilmdersdorf
2,5,Abbestraße,1,NaN,19,NaN,U,4,30,6,22,Charl,10587,NaN,charlottenburg-wilmdersdorf
3,5,Abbestraße,2,NaN,12,NaN,G,4,30,6,22,Charl,10587,NaN,charlottenburg-wilmdersdorf
4,8793,Adam-von-Trott-Straße,1,NaN,7,NaN,U,4,10,1,1,CharN,13627,NaN,charlottenburg-wilmdersdorf

(1701, 15)
../data/input/berlin_adresses/2023/adr_friedrichshain-kreuzberg_2023.pdf
[5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
Index: []

[['friedrichshain-kreuzberg']]
page: 5
(47, 15)
page: 7
(95, 15)
page: 9
(143, 15)
page: 10
(191, 15)
page: 11
(239, 15)
page: 13
(287, 15)
page: 14
(335, 15)
page: 16
(383, 15)
page: 20
(431, 15)
page: 24
(479, 15)
page: 25
(527, 15)
page: 27
(575, 15)
page: 29
(623, 15)
page: 30
(671, 15)
page: 32
(715, 15)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,6081,Adalbertstraße,1,NaN,11,NaN,U,2,30,3,14,Kreuz,10999,NaN,friedrichshain-kreuzberg
1,6081,Adalbertstraße,2,NaN,10,NaN,G,2,30,3,14,Kreuz,10999,NaN,friedrichshain-kreuzberg
2,6081,Adalbertstraße,13,NaN,23,B,U,2,30,3,14,Kreuz,10997,NaN,friedrichshain-kreuzberg
3,6081,Adalbertstraße,14,NaN,22,NaN,G,2,30,3,14,Kreuz,10997,NaN,friedrichshain-kreuzberg
4,6081,Adalbertstraße,24,NaN,66,NaN,G,1,10,3,13,Mitte,10179,J,friedrichshain-kreuzberg

(715, 15)
../data/input/berlin_adresses/2023/adr_lichtenberg_2023.pdf
[5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
Index: []

[['lichtenberg']]
page: 6
(48, 15)
page: 7
(96, 15)
page: 8
(144, 15)
page: 9
(192, 15)
page: 11
(240, 15)
page: 12
(288, 15)
page: 14
(336, 15)
page: 16
(384, 15)
page: 17
(432, 15)
page: 18
(480, 15)
page: 19
(528, 15)
page: 20
(576, 15)
page: 21
(624, 15)
page: 25
(672, 15)
page: 27
(720, 15)
page: 28
(768, 15)
page: 30
(816, 15)
page: 31
(864, 15)
page: 33
(912, 15)
page: 35
(960, 15)
page: 36
(1008, 15)
page: 37
(1016, 15)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,44843,Alt-Friedrichsfelde,87,NaN,127,A,U,11,40,10,32,Frife,10315,NaN,lichtenberg
1,44843,Alt-Friedrichsfelde,88,NaN,126,NaN,G,11,40,10,32,Frife,10315,NaN,lichtenberg
2,10848,Alzeyweg,2,NaN,44,NaN,G,11,30,7,25,Liber,10365,NaN,lichtenberg
3,10875,Am Ahornweg,12,NaN,84,NaN,G,11,10,1,1,Wartb,13059,NaN,lichtenberg
4,10875,Am Ahornweg,13,NaN,85,NaN,U,11,10,1,1,Wartb,13059,NaN,lichtenberg

(1016, 15)
../data/input/berlin_adresses/2023/adr_marzahn-hellersdorf_2023.pdf
[5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
Index: []

[['marzahn-hellersdorf']]
page: 5
(48, 15)
page: 7
(96, 15)
page: 8
(144, 15)
page: 9
(192, 15)
page: 11
(240, 15)
page: 12
(288, 15)
page: 13
(336, 15)
page: 15
(384, 15)
page: 16
(432, 15)
page: 17
(480, 15)
page: 19
(528, 15)
page: 20
(576, 15)
page: 21
(624, 15)
page: 22
(672, 15)
page: 23
(720, 15)
page: 24
(768, 15)
page: 25
(816, 15)
page: 28
(864, 15)
page: 29
(912, 15)
page: 30
(960, 15)
page: 33
(1008, 15)
page: 34
(1056, 15)
page: 35
(1104, 15)
page: 37
(1152, 15)
page: 38
(1200, 15)
page: 39
(1248, 15)
page: 40
(1296, 15)
page: 41
(1344, 15)
page: 42
(1392, 15)
page: 43
(1440, 15)
page: 44
(1488, 15)
page: 45
(1523, 15)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,40004,Achardstraße,1,NaN,29,NaN,U,10,40,8,37,Kauld,12621,NaN,marzahn-hellersdorf
1,40004,Achardstraße,2,NaN,32,NaN,G,10,40,8,37,Kauld,12621,NaN,marzahn-hellersdorf
2,44831,Adele-Sandrock-Straße,1,NaN,113,NaN,U,10,20,5,24,Helld,12627,NaN,marzahn-hellersdorf
3,44831,Adele-Sandrock-Straße,8,NaN,106,NaN,G,10,20,5,24,Helld,12627,NaN,marzahn-hellersdorf
4,43847,Adersleber Weg,1,NaN,7,NaN,U,10,10,3,15,Marza,12685,NaN,marzahn-hellersdorf

(1523, 15)
../data/input/berlin_adresses/2023/adr_mitte_2023.pdf
[5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
Index: []

[['mitte']]
page: 6
(48, 15)
page: 7
(96, 15)
page: 9
(144, 15)
page: 12
(192, 15)
page: 13
(240, 15)
page: 14
(288, 15)
page: 15
(336, 15)
page: 17
(384, 15)
page: 18
(432, 15)
page: 20
(480, 15)
page: 22
(528, 15)
page: 25
(576, 15)
page: 26
(624, 15)
page: 27
(672, 15)
page: 31
(720, 15)
page: 32
(768, 15)
page: 34
(816, 15)
page: 37
(864, 15)
page: 38
(912, 15)
page: 45
(960, 15)
page: 46
(1008, 15)
page: 48
(1056, 15)
page: 49
(1083, 15)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,6082,Alexandrinenstraße,92,NaN,100,NaN,G,2,10,1,3,Kreuz,10969,J,mitte
1,6082,Alexandrinenstraße,115,NaN,123,NaN,U,2,10,1,5,Kreuz,10969,J,mitte
2,6082,Alexandrinenstraße,116,NaN,124,NaN,G,2,10,1,5,Kreuz,10969,J,mitte
3,6082,Alexandrinenstraße,125,NaN,125,NaN,U,2,10,1,3,Kreuz,10969,J,mitte
4,6082,Alexandrinenstraße,128,NaN,128,NaN,G,2,10,1,3,Kreuz,10969,J,mitte

(1083, 15)
../data/input/berlin_adresses/2023/adr_neukoelln_2023.pdf
[5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
Index: []

[['neukoelln']]
page: 5
(48, 15)
page: 6
(96, 15)
page: 7
(144, 15)
page: 9
(192, 15)
page: 11
(240, 15)
page: 13
(288, 15)
page: 14
(336, 15)
page: 15
(384, 15)
page: 16
(432, 15)
page: 17
(480, 15)
page: 18
(528, 15)
page: 19
(576, 15)
page: 21
(624, 15)
page: 22
(672, 15)
page: 24
(720, 15)
page: 26
(768, 15)
page: 27
(816, 15)
page: 30
(864, 15)
page: 32
(912, 15)
page: 33
(960, 15)
page: 34
(1008, 15)
page: 35
(1056, 15)
page: 38
(1104, 15)
page: 39
(1152, 15)
page: 40
(1200, 15)
page: 42
(1248, 15)
page: 43
(1267, 15)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,24,Agnes-Straub-Weg,1,NaN,5,NaN,U,8,30,10,37,Grops,12353,NaN,neukoelln
1,24,Agnes-Straub-Weg,2,NaN,22,NaN,G,8,30,10,37,Grops,12353,NaN,neukoelln
2,43,Albersweilerweg,1,NaN,61,NaN,U,8,20,8,32,Buckw,12349,NaN,neukoelln
3,43,Albersweilerweg,6,NaN,52,NaN,G,8,20,8,32,Buckw,12349,NaN,neukoelln
4,5836,Alfred-Rojek-Weg,5,NaN,63,NaN,U,8,40,12,43,Rudow,12355,NaN,neukoelln

(1267, 15)
../data/input/berlin_adresses/2023/adr_pankow_2023.pdf
[5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64, 65, 66, 67, 68, 69, 70, 71]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
Index: []

[['pankow']]
page: 5
(48, 15)
page: 6
(96, 15)
page: 7
(144, 15)
page: 8
(192, 15)
page: 9
(240, 15)
page: 10
(288, 15)
page: 13
(336, 15)
page: 14
(384, 15)
page: 16
(432, 15)
page: 17
(480, 15)
page: 19
(528, 15)
page: 20
(576, 15)
page: 21
(624, 15)
page: 22
(672, 15)
page: 23
(720, 15)
page: 24
(768, 15)
page: 26
(816, 15)
page: 28
(864, 15)
page: 31
(912, 15)
page: 34
(960, 15)
page: 37
(1008, 15)
page: 38
(1056, 15)
page: 39
(1104, 15)
page: 40
(1152, 15)
page: 41
(1200, 15)
page: 46
(1248, 15)
page: 47
(1296, 15)
page: 49
(1344, 15)
page: 50
(1392, 15)
page: 51
(1440, 15)
page: 52
(1488, 15)
page: 53
(1536, 15)
page: 54
(1584, 15)
page: 56
(1632, 15)
page: 57
(1680, 15)
page: 58
(1728, 15)
page: 59
(1776, 15)
page: 60
(1824, 15)
page: 61
(1872, 15)
page: 62
(1920, 15)
page: 63
(1968, 15)
page: 64
(2016, 15)
page: 65
(2064, 15)
page: 66
(2112, 15)
page: 67
(2160, 15)
page: 69
(2208, 15)
page: 70
(2256, 15)
page: 71
(2260, 15)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,40001,Aalesunder Straße,1,NaN,11,NaN,U,3,60,11,39,Prenz,10439,NaN,pankow
1,40001,Aalesunder Straße,2,NaN,10,NaN,G,3,60,11,39,Prenz,10439,NaN,pankow
2,8610,Abajstraße,2,NaN,2,NaN,G,3,20,2,5,Roset,13158,NaN,pankow
3,8610,Abajstraße,3,NaN,13,NaN,U,3,20,2,5,Roset,13158,NaN,pankow
4,6431,Achillesstraße,1,NaN,107,NaN,U,3,30,4,11,Karow,13125,NaN,pankow

(2260, 15)
../data/input/berlin_adresses/2023/adr_reinickendorf_2023.pdf
[5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
Index: []

[['reinickendorf']]
page: 5
(48, 15)
page: 7
(96, 15)
page: 8
(144, 15)
page: 10
(192, 15)
page: 11
(240, 15)
page: 12
(288, 15)
page: 14
(336, 15)
page: 15
(384, 15)
page: 16
(432, 15)
page: 17
(480, 15)
page: 18
(528, 15)
page: 19
(576, 15)
page: 20
(624, 15)
page: 21
(672, 15)
page: 22
(720, 15)
page: 23
(768, 15)
page: 24
(816, 15)
page: 25
(864, 15)
page: 27
(912, 15)
page: 29
(960, 15)
page: 31
(1008, 15)
page: 32
(1056, 15)
page: 33
(1104, 15)
page: 34
(1152, 15)
page: 38
(1200, 15)
page: 39
(1248, 15)
page: 40
(1296, 15)
page: 41
(1344, 15)
page: 42
(1392, 15)
page: 43
(1440, 15)
page: 44
(1488, 15)
page: 45
(1536, 15)
page: 46
(1584, 15)
page: 47
(1632, 15)
page: 48
(1680, 15)
page: 49
(1728, 15)
page: 50
(1760, 15)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,9,Ackerplanweg,2,NaN,24,NaN,G,12,50,8,24,Tegel,13509,NaN,reinickendorf
1,9,Ackerplanweg,3,NaN,17,NaN,U,12,50,8,24,Tegel,13509,NaN,reinickendorf
2,14,Adelheidallee,1,NaN,19,NaN,U,12,20,5,15,Tegel,13507,NaN,reinickendorf
3,14,Adelheidallee,4,NaN,4,NaN,G,12,20,5,15,Tegel,13507,NaN,reinickendorf
4,20,Aegirstraße,1,NaN,11,NaN,U,12,10,1,1,Reind,13409,NaN,reinickendorf

(1760, 15)
../data/input/berlin_adresses/2023/adr_spandau_2023.pdf
[5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
Index: []

[['spandau']]
page: 5
(48, 15)
page: 6
(96, 15)
page: 7
(144, 15)
page: 8
(192, 15)
page: 9
(240, 15)
page: 10
(288, 15)
page: 11
(336, 15)
page: 12
(384, 15)
page: 13
(432, 15)
page: 14
(480, 15)
page: 15
(528, 15)
page: 16
(576, 15)
page: 17
(624, 15)
page: 18
(672, 15)
page: 20
(720, 15)
page: 23
(768, 15)
page: 24
(816, 15)
page: 26
(864, 15)
page: 27
(912, 15)
page: 28
(960, 15)
page: 29
(1008, 15)
page: 30
(1056, 15)
page: 31
(1104, 15)
page: 32
(1152, 15)
page: 34
(1200, 15)
page: 35
(1248, 15)
page: 36
(1296, 15)
page: 37
(1344, 15)
page: 38
(1392, 15)
page: 40
(1440, 15)
page: 41
(1488, 15)
page: 42
(1536, 15)
page: 43
(1584, 15)
page: 45
(1632, 15)
page: 46
(1680, 15)
page: 47
(1728, 15)
page: 48
(1776, 15)
page: 49
(1824, 15)
page: 50
(1872, 15)
page: 51
(1882, 15)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,2,Aalemannufer,1,NaN,31,NaN,U,5,10,1,1,Haken,13587,NaN,spandau
1,2,Aalemannufer,4,NaN,14,NaN,G,5,10,1,1,Haken,13587,NaN,spandau
2,7,Achenbachstraße,5,NaN,15,NaN,U,5,10,3,15,Spand,13585,NaN,spandau
3,7,Achenbachstraße,6,NaN,14,NaN,G,5,10,3,15,Spand,13585,NaN,spandau
4,11,Ackerstraße,2,NaN,2,NaN,G,5,10,3,12,Spand,13585,NaN,spandau

(1882, 15)
../data/input/berlin_adresses/2023/adr_steglitz-zehlendorf_2023.pdf
[5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62, 63, 64]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
Index: []

[['steglitz-zehlendorf']]
page: 5
(48, 15)
page: 6
(96, 15)
page: 7
(144, 15)
page: 8
(192, 15)
page: 9
(240, 15)
page: 11
(288, 15)
page: 12
(336, 15)
page: 13
(384, 15)
page: 15
(432, 15)
page: 16
(480, 15)
page: 17
(528, 15)
page: 18
(576, 15)
page: 19
(624, 15)
page: 20
(672, 15)
page: 22
(720, 15)
page: 23
(768, 15)
page: 24
(816, 15)
page: 27
(864, 15)
page: 28
(912, 15)
page: 29
(960, 15)
page: 30
(1008, 15)
page: 31
(1056, 15)
page: 32
(1104, 15)
page: 33
(1152, 15)
page: 34
(1200, 15)
page: 35
(1248, 15)
page: 36
(1296, 15)
page: 37
(1344, 15)
page: 38
(1392, 15)
page: 40
(1440, 15)
page: 41
(1488, 15)
page: 43
(1536, 15)
page: 44
(1584, 15)
page: 45
(1632, 15)
page: 46
(1680, 15)
page: 49
(1728, 15)
page: 50
(1776, 15)
page: 51
(1824, 15)
page: 53
(1872, 15)
page: 54
(1920, 15)
page: 56
(1968, 15)
page: 58
(2016, 15)
page: 61
(2064, 15)
page: 62
(2112, 15)
page: 63
(2160, 15)
page: 64
(2208, 15)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,3,Aarauer Straße,2,NaN,40,NaN,G,6,30,6,32,Lifel,12205,NaN,steglitz-zehlendorf
1,3,Aarauer Straße,3,NaN,41,NaN,U,6,30,6,32,Lifel,12205,NaN,steglitz-zehlendorf
2,4,Aarberger Straße,7,NaN,17,NaN,U,6,30,6,32,Lifel,12205,NaN,steglitz-zehlendorf
3,4,Aarberger Straße,8,NaN,18,NaN,G,6,30,6,32,Lifel,12205,NaN,steglitz-zehlendorf
4,8,Achenseeweg,3,NaN,93,NaN,U,6,20,4,23,Lifel,12209,NaN,steglitz-zehlendorf

(2208, 15)
../data/input/berlin_adresses/2023/adr_tempelhof-schoeneberg_2023.pdf
[5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
Index: []

[['tempelhof-schoeneberg']]
page: 5
(48, 15)
page: 6
(96, 15)
page: 8
(144, 15)
page: 9
(192, 15)
page: 10
(240, 15)
page: 11
(288, 15)
page: 13
(336, 15)
page: 14
(384, 15)
page: 15
(432, 15)
page: 16
(480, 15)
page: 17
(528, 15)
page: 18
(576, 15)
page: 19
(624, 15)
page: 20
(672, 15)
page: 21
(720, 15)
page: 22
(768, 15)
page: 23
(816, 15)
page: 26
(864, 15)
page: 27
(912, 15)
page: 30
(960, 15)
page: 33
(1008, 15)
page: 34
(1056, 15)
page: 35
(1104, 15)
page: 36
(1152, 15)
page: 37
(1200, 15)
page: 41
(1248, 15)
page: 42
(1296, 15)
page: 44
(1344, 15)
page: 50
(1392, 15)
page: 51
(1440, 15)
page: 52
(1488, 15)
page: 53
(1526, 15)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,6,Abendrotweg,3,NaN,25,NaN,U,7,60,15,46,Lirad,12307,NaN,tempelhof-schoeneberg
1,6,Abendrotweg,4,NaN,26,NaN,G,7,60,15,46,Lirad,12307,NaN,tempelhof-schoeneberg
2,6905,Adolf-Scheidt-Platz,1,NaN,19,NaN,U,7,40,7,21,Temph,12101,NaN,tempelhof-schoeneberg
3,6905,Adolf-Scheidt-Platz,2,NaN,20,NaN,G,7,40,7,21,Temph,12101,NaN,tempelhof-schoeneberg
4,31,Ahornstraße,1,NaN,5,NaN,U,7,10,1,2,Schön,10787,NaN,tempelhof-schoeneberg

(1526, 15)
../data/input/berlin_adresses/2023/adr_treptow-koepenick_2023.pdf
[5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 38, 39, 40, 41, 42, 43, 44, 45, 46, 47, 48, 49, 50, 51, 52, 53, 54, 55, 56, 57, 58, 59, 60, 61, 62]
[0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12]

Empty DataFrame
Columns: [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]
Index: []

[['treptow-koepenick']]
page: 5
(48, 15)
page: 6
(96, 15)
page: 8
(144, 15)
page: 9
(192, 15)
page: 10
(240, 15)
page: 11
(288, 15)
page: 12
(336, 15)
page: 14
(384, 15)
page: 17
(432, 15)
page: 19
(480, 15)
page: 20
(528, 15)
page: 21
(576, 15)
page: 22
(624, 15)
page: 23
(672, 15)
page: 24
(720, 15)
page: 25
(768, 15)
page: 26
(816, 15)
page: 28
(864, 15)
page: 29
(912, 15)
page: 31
(960, 15)
page: 32
(1008, 15)
page: 33
(1056, 15)
page: 35
(1104, 15)
page: 36
(1152, 15)
page: 37
(1200, 15)
page: 38
(1248, 15)
page: 39
(1296, 15)
page: 40
(1344, 15)
page: 41
(1392, 15)
page: 42
(1440, 15)
page: 43
(1488, 15)
page: 44
(1536, 15)
page: 45
(1584, 15)
page: 46
(1632, 15)
page: 48
(1680, 15)
page: 49
(1728, 15)
page: 50
(1776, 15)
page: 51
(1824, 15)
page: 52
(1872, 15)
page: 53
(1920, 15)
page: 55
(1968, 15)
page: 56
(2016, 15)
page: 57
(2064, 15)
page: 58
(2112, 15)
page: 59
(2160, 15)
page: 60
(2208, 15)
page: 61
(2256, 15)
page: 62
(2282, 15)

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,9497,Aalstieg,1,NaN,17,NaN,U,9,50,18,38,Rahnd,12589,NaN,treptow-koepenick
1,9497,Aalstieg,2,NaN,38,NaN,G,9,50,18,38,Rahnd,12589,NaN,treptow-koepenick
2,11206,Abendseglersteig,2,NaN,78,NaN,G,9,50,18,38,Rahnd,12589,NaN,treptow-koepenick
3,11206,Abendseglersteig,11,NaN,75,NaN,U,9,50,18,38,Rahnd,12589,NaN,treptow-koepenick
4,8834,Abram-Joffe-Straße,2,NaN,18,NaN,G,9,20,7,15,Adler,12489,NaN,treptow-koepenick

(2282, 15)

In [ ]:
# import_data = read_pdf('../data/input/berlin_adresses/2023/adr_charlottenburg-wilmdersdorf_2023.pdf', pages = '5', encoding = 'ISO-8859-1', stream = True, area = [175, 33, 783, 520], guess = False, pandas_options={'header': None})

# # was saved as a list -> need to transformt it into dataframe 
# table_df = import_data[0]

# table_df